БухЭксп/Reports/CW_АктСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_АктСверкиВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЛицаПодписывающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЛицаПодписывающиеДокументы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжностьАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыЛицПодписывающихДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Reports/CW_АктСверкиВзаиморасчетов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция СформироватьОтчет(Результат=Неопределено, ДанныеРасшифровки = Неопределено) Экспорт
	
	Если Результат=Неопределено Тогда
		Результат = Новый ТабличныйДокумент;
	КонецЕсли;
	
	Результат.АвтоМасштаб=Истина;
	Результат.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	
	ДатаПараметров = ?(КонецПериода=Дата(1,1,1),ТекущаяДата(),КонецПериода); 
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ?(ЗначениеЗаполнено(ЭтотОбъект.НачалоПериода),ЭтотОбъект.НачалоПериода, ТекущаяДата());
	СтруктураПараметров.Договор 			= ЭтотОбъект.Договор;
	
	ПД	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	УП = CW_Настройки.ПараметрыУчетнойПолитики(ДатаПараметров, Договор.Организация);
	БазоваяВалюта = CW_Настройки.ВалютаРегламентированногоУчета();
	
	ЭтоПокупатель = (Договор.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	ЭтоПоставщик = НЕ ЭтоПокупатель;
	
	РасчетыБВ = (Договор.ВалютаДоговора = БазоваяВалюта);
	
	Счета = CW_Конфигурация.ПланСчетов(); 
	
	ФорматД = "ЧЦ=15; ЧДЦ=2; ЧН=-";
	ФорматДаты = "ДФ=dd.MM.yy";
	
	СальдоПоАвансам = 0;
	СальдоПоЗадолженности = 0;
	
	// ---------------------------------------------------------------------------- 
	
	Макет = ПолучитьМакет("Макет");
	// --- 
	СформироватьРеквизитыШапки(Результат,Макет,Договор,ПД);
	
	// формируем основной текст
	СформироватьШапку(Результат,Макет,Договор,ПД);
	
	// ---------------------------------------------------------------------------- 
	
	СписокСчетов = Новый Массив;
	Если ЭтоПоставщик Тогда
		
		Если РасчетыБВ Тогда
			
			СчетП = УП.СчетРасчетов_Поставщики_Рубли;
			Если УП.СчетРасчетов_Поставщики_Рубли = Счета.РасчетыСПоставщиками Тогда
				
				СписокСчетов.Добавить(Счета.РасчетыПоАвансамВыданным);
				
			КонецЕсли; 
			
		Иначе
			
			Если НЕ Договор.ВзаиморасчетыВУЕ Тогда
				
				СчетП = УП.СчетРасчетов_Поставщики_Валюта;
				Если УП.СчетРасчетов_Поставщики_Валюта = Счета.РасчетыСПоставщикамиВал Тогда
					
					СписокСчетов.Добавить(Счета.РасчетыПоАвансамВыданнымВал);
					
				КонецЕсли; 
				
			Иначе
				
				СчетП = УП.СчетРасчетов_Поставщики_УЕ;
				Если УП.СчетРасчетов_Поставщики_УЕ = Счета.РасчетыСПоставщикамиУЕ Тогда
					
					СписокСчетов.Добавить(Счета.РасчетыПоАвансамВыданнымУЕ);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		// --- 
		СписокСчетов.Добавить(СчетП);
		
	ИначеЕсли ЭтоПокупатель Тогда 
		
		Если РасчетыБВ Тогда
			
			СчетК = Счета.РасчетыСПокупателями;
			СчетКА = Счета.РасчетыПоАвансамПолученным;
			СчетКВ = УП.СчетРасчетов_Клиенты_Рубли;
						
		Иначе
			
			Если НЕ Договор.ВзаиморасчетыВУЕ Тогда
				
				СчетК = Счета.РасчетыСПокупателямиВал;
				СчетКА = Счета.РасчетыПоАвансамПолученнымВал;
				СчетКВ = УП.СчетРасчетов_Клиенты_Валюта;
				
			Иначе
				
				СчетК = Счета.РасчетыСПокупателямиУЕ;
				СчетКА = Счета.РасчетыПоАвансамПолученнымУЕ;
				СчетКВ = УП.СчетРасчетов_Клиенты_УЕ;
				
			КонецЕсли; 
			
		КонецЕсли; 
		// --- 
		СписокСчетов.Добавить(СчетК);
		СписокСчетов.Добавить(СчетКА);
		Если СчетКВ <> СчетК Тогда
			
			СписокСчетов.Добавить(СчетКВ);
			
		КонецЕсли; 
		
	КонецЕсли; 
	// --- 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Договор", 	Договор);
	СтруктураПараметров.Вставить("ПриложениеКДоговору",	ПриложениеКДоговору);
	
	УчетныйДоговор = CW_Финансы.ПолучитьУчетныйДоговор(СтруктураПараметров);
	
	// таблица ОСВ
	// --- 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОстаткиИОбороты.Счет,
	               |	ХозрасчетныйОстаткиИОбороты.Субконто3 КАК Документ,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК НС_Р,
	               |	ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаНачальныйОстаток КАК НС_В,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК ДО_Р,
	               |	ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотДт КАК ДО_В,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК КО_Р,
	               |	ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотКт КАК КО_В,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК КС_Р,
	               |	ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаКонечныйОстаток КАК КС_В,
	               |	ЛОЖЬ КАК ЭтоАванс,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК Дата
	               |ПОМЕСТИТЬ вр1
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Счет В (&СписокСчетов),
	               |			,
	               |			Субконто1 = &Контрагент
	               |				И Субконто2 = &Договор
	               |				И Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вр1.Счет,
	               |	вр1.Документ,
	               |	вр1.ЭтоАванс,
	               |	вр1.Дата,
	               |	ВЫБОР
	               |		КОГДА &БВ = ИСТИНА
	               |			ТОГДА вр1.НС_Р
	               |		ИНАЧЕ вр1.НС_В
	               |	КОНЕЦ КАК НС,
	               |	ВЫБОР
	               |		КОГДА &БВ = ИСТИНА
	               |			ТОГДА вр1.ДО_Р
	               |		ИНАЧЕ вр1.ДО_В
	               |	КОНЕЦ КАК ДО,
	               |	ВЫБОР
	               |		КОГДА &БВ = ИСТИНА
	               |			ТОГДА вр1.КО_Р
	               |		ИНАЧЕ вр1.КО_В
	               |	КОНЕЦ КАК КО,
	               |	ВЫБОР
	               |		КОГДА &БВ = ИСТИНА
	               |			ТОГДА вр1.КС_Р
	               |		ИНАЧЕ вр1.КС_В
	               |	КОНЕЦ КАК КС
	               |ИЗ
	               |	вр1 КАК вр1";
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);
	Запрос.УстановитьПараметр("Организация",	Договор.Организация);
	
	Запрос.УстановитьПараметр("КонецПериода",	КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("БВ",				Договор.ВалютаДоговора=БазоваяВалюта);
	Запрос.УстановитьПараметр("СписокСчетов",	СписокСчетов);
	Запрос.УстановитьПараметр("Договор",		УчетныйДоговор);

	
	ТаблицаОСВ = Запрос.Выполнить().Выгрузить();
	
	// таблица зачета
	// --- 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйДвиженияССубконто.Регистратор,
	               |	ХозрасчетныйДвиженияССубконто.СчетДт,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоДт3 КАК ДокументДт,
	               |	ХозрасчетныйДвиженияССубконто.СчетКт,
	               |	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК ДокументКт,
	               |	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаДт КАК Дт_В,
	               |	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаКт КАК Кт_В,
	               |	ХозрасчетныйДвиженияССубконто.Сумма
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Организация = &Организация
	               |				И (Счет В (&СписокСчетов)
	               |					И Субконто1 = &Контрагент
	               |					И Субконто2 = &Договор),
	               |			,
	               |			) КАК ХозрасчетныйДвиженияССубконто";
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);
	Запрос.УстановитьПараметр("Организация",	Договор.Организация);
	
	Запрос.УстановитьПараметр("КонецПериода",	КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("БВ",				Договор.ВалютаДоговора=БазоваяВалюта);
	Запрос.УстановитьПараметр("СписокСчетов",	СписокСчетов);
	Запрос.УстановитьПараметр("Договор",		УчетныйДоговор);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	// ---------------------------------------------------------------------------- 
	
	ТипыДокументовАванса = Новый СписокЗначений;
	Если ЭтоПокупатель Тогда
		
		ТипыДокументовАванса.Добавить(Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет"));
		ТипыДокументовАванса.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
		
	Иначе
		
		ТипыДокументовАванса.Добавить(Тип("ДокументСсылка.СписаниеСРасчетногоСчета"));
		ТипыДокументовАванса.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
		
	КонецЕсли; 
	ТипВводаНачальныхОстатков = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом");
	
	// теперь анализируем таблицы
	// ---------------------------------------------------------------------------- 
	Для каждого Стр Из ТаблицаОСВ Цикл
		
		ТипДокумента = ТипЗнч(Стр.Документ);
		Стр.ЭтоАванс = (ТипыДокументовАванса.НайтиПоЗначению(ТипДокумента) <> Неопределено);
		
		// если это не аванс, то дополнительно проверяем, не является ли документ вводом начальных остатков (документом расчетов с контрагентом)
		// если является, то смотрим на сальдо начальное, для договора с покупателем
		// отрицательное сальдо - аванс, положительное - задолженность
		
		Если НЕ Стр.ЭтоАванс Тогда
			
			Если ТипДокумента = ТипВводаНачальныхОстатков Тогда
				
				Если ЭтоПокупатель Тогда
					
					Если Стр.Счет.Вид = ВидСчета.Пассивный И Стр.КО > 0 Тогда
						
						Стр.ЭтоАванс = Истина;
						
					КонецЕсли; 
					
				Иначе
					
					Если Стр.Счет.Вид = ВидСчета.Активный И Стр.ДО > 0 Тогда
						
						Стр.ЭтоАванс = Истина;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
						
		КонецЕсли; 		
		
	КонецЦикла; 
	
	// добавляем колонку под представление документа и комментарий
	_сф.т_ДобавитьКолонку(ТаблицаОСВ,"ВедущийДокумент",,"");
	_сф.т_ДобавитьКолонку(ТаблицаОСВ,"ПредставлениеДокумента",,"");
	_сф.т_ДобавитьКолонку(ТаблицаОСВ,"Комментарий",,"");

	// подбираем документы закрытия
	// ---------------------------------------------------------------------------- 
	Для каждого Стр Из ТаблицаОСВ Цикл
		
		// формируем представление
		Если ТипЗнч(Стр.Документ)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			ВД = CW_Документы.ПолучитьВедущийДокумент(Стр.Документ);
			Если ВД <> Неопределено Тогда
				
				Стр.ВедущийДокумент = ВД;
				СПД = ПредставлениеДокумента(ВД);
				
			Иначе
				
				СПД = ПредставлениеДокумента(Стр.Документ);
				
			КонецЕсли; 
			
		ИначеЕсли ТипЗнч(Стр.Документ)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
			
			ВД = CW_Документы.ПолучитьВедущийДокумент(Стр.Документ);
			Если ВД <> Неопределено Тогда
				
				Стр.ВедущийДокумент = ВД;
				СПД = ПредставлениеДокумента(ВД);
				
			Иначе
				
				СПД = ПредставлениеДокумента(Стр.Документ);
				
			КонецЕсли;
			
		Иначе
			
			СПД = ПредставлениеДокумента(Стр.Документ);
			
		КонецЕсли; 
		
		Стр.ПредставлениеДокумента = СПД.Представление;
		Стр.Дата = СПД.Дата;
		// --- 
		
		ТаблицаЗачета = Неопределено;
		ИмяКолонкиКоррДокумента = "";
		
		Если ЭтоПокупатель Тогда
			
			// аванс с зачетом
			Если Стр.ЭтоАванс И Стр.ДО <> 0 Тогда
				
				// отбираем движения, где ДокументДт = Стр.Документ (Дт СчетАванса (ДокументАвансса) - Кт х)
				ИмяКолонкиКоррДокумента = "ДокументКт";
				ИмяКолонкиВалютнойСуммы = "Кт_В";
				Отбор = _сф.ст_Создать("СчетДт:Счет,ДокументДт:Документ",Стр);
				ТаблицаЗачета = ТаблицаДвижений.Скопировать(Отбор);
								
			КонецЕсли;
			
			// задолженность с оплатой
			Если НЕ Стр.ЭтоАванс И Стр.КО <> 0 Тогда 
				
				// отбираем движения, где ДокументКт = Стр.Документ (Кт СчетРасчета (ДокументАвансса) - Кт х)
				ИмяКолонкиКоррДокумента = "ДокументДт";
				ИмяКолонкиВалютнойСуммы = "Дт_В";
				Отбор = _сф.ст_Создать("СчетКт:Счет,ДокументКт:Документ",Стр);
				ТаблицаЗачета = ТаблицаДвижений.Скопировать(Отбор);
				
			КонецЕсли; 
			
		Иначе // поставщик
			
			// аванс с зачетом
			Если Стр.ЭтоАванс И Стр.КО <> 0 Тогда
				
				// отбираем движения, где ДокументДт = Стр.Документ (Дт СчетАванса (ДокументАвансса) - Кт х)
				ИмяКолонкиКоррДокумента = "ДокументДт";
				ИмяКолонкиВалютнойСуммы = "Кт_В";
				Отбор = _сф.ст_Создать("СчетКт:Счет,ДокументКт:Документ",Стр);
				ТаблицаЗачета = ТаблицаДвижений.Скопировать(Отбор);
								
			КонецЕсли;
			
			// задолженность с оплатой/зачётом
			Если НЕ Стр.ЭтоАванс И Стр.ДО <> 0 Тогда 
				
				// отбираем движения, где ДокументКт = Стр.Документ (Кт СчетРасчета (ДокументАвансса) - Кт х)
				ИмяКолонкиКоррДокумента = "ДокументКт";
				ИмяКолонкиВалютнойСуммы = "Дт_В";
				Отбор = _сф.ст_Создать("СчетДт:Счет,ДокументДт:Документ",Стр);
				ТаблицаЗачета = ТаблицаДвижений.Скопировать(Отбор);
				
			КонецЕсли;
			
		КонецЕсли; 
		
		// --- 
		Если ТаблицаЗачета = Неопределено Тогда
			
			// представления нет
	       Стр.Комментарий = "";
			
		Иначе
			
			// формируем представление документов по зачету
			
			ТаблицаЗачетаПоБлоку = _сф.т_Создать("Документ,Сумма");
			
			Для каждого СтрД Из ТаблицаЗачета Цикл
				
				Если ЭтоПокупатель Тогда
					
					КоррДокумент = СтрД[ИмяКолонкиКоррДокумента];
					Если КоррДокумент = Null Тогда
						
						КоррДокумент = СтрД["Регистратор"];
						
					КонецЕсли;
					
					Если Стр.ЭтоАванс Тогда
						
						Если ТипЗнч(КоррДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
							
							// проверяем, что документ является ведомым
							ВД = CW_Документы.ПолучитьВедущийДокумент(КоррДокумент);
							Если ВД <> Неопределено Тогда
								
								Нстр = ТаблицаЗачетаПоБлоку.Добавить();
								Нстр.Документ = ВД;
								Нстр.Сумма = ?(РасчетыБВ,СтрД.Сумма,СтрД[ИмяКолонкиВалютнойСуммы]); 
								
							КонецЕсли; 
							
						КонецЕсли;
						
					Иначе
						
						Если ТипЗнч(КоррДокумент) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет")
							ИЛИ ТипЗнч(КоррДокумент) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
							
							Нстр = ТаблицаЗачетаПоБлоку.Добавить();
							Нстр.Документ = КоррДокумент;
							Нстр.Сумма = ?(РасчетыБВ,СтрД.Сумма,СтрД[ИмяКолонкиВалютнойСуммы]);
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				Иначе
					
					КоррДокумент = СтрД[ИмяКолонкиКоррДокумента];
					Если КоррДокумент = Null Тогда
						
						КоррДокумент = СтрД["Регистратор"];
						
					КонецЕсли; 
					
					Если Стр.ЭтоАванс Тогда
						
						Если ТипЗнч(КоррДокумент) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
							
							// проверяем, что документ является ведомым
							ВД = CW_Документы.ПолучитьВедущийДокумент(КоррДокумент);
							Если ВД <> Неопределено Тогда
								
								Нстр = ТаблицаЗачетаПоБлоку.Добавить();
								Нстр.Документ = ВД;
								Нстр.Сумма = ?(РасчетыБВ,СтрД.Сумма,СтрД[ИмяКолонкиВалютнойСуммы]); 
								
							КонецЕсли; 
							
						КонецЕсли;
						
					Иначе
						
						Если ТипЗнч(КоррДокумент) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета")
							ИЛИ ТипЗнч(КоррДокумент) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
							
							Нстр = ТаблицаЗачетаПоБлоку.Добавить();
							Нстр.Документ = КоррДокумент;
							Нстр.Сумма = ?(РасчетыБВ,СтрД.Сумма,СтрД[ИмяКолонкиВалютнойСуммы]);
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если ТаблицаЗачетаПоБлоку.Количество() <> 0 Тогда
				
				ТаблицаЗачетаПоБлоку.Свернуть("Документ","Сумма");
				_сф.т_ДобавитьКолонку(ТаблицаЗачетаПоБлоку,"Дата",,Дата(1,1,1));
				_сф.т_ДобавитьКолонку(ТаблицаЗачетаПоБлоку,"Представление",,"");
				// --- 
				Для каждого СтрД Из ТаблицаЗачетаПоБлоку Цикл
					
					СПД = ПредставлениеДокумента(СтрД.Документ);
					СтрД.Дата = СПД.Дата;
					СтрД.Представление = СПД.Представление;
					
				КонецЦикла; 
				ТаблицаЗачетаПоБлоку.Сортировать("Дата Возр");
				
				СтрокаКомментария = "";
				Для каждого СтрД Из ТаблицаЗачетаПоБлоку Цикл
					
					Если СтрокаКомментария <> "" Тогда
						
						_сф.стр_Добавить(СтрокаКомментария,";"+Символы.ПС);
						
					КонецЕсли; 
					
					_сф.стр_Добавить(СтрокаКомментария,СтрЗаменить(СтрД.Представление,";","") + " - "+Формат(СтрД.Сумма,"ЧЦ=15; ЧДЦ=2; ЧН="));
					
				КонецЦикла; 
				Стр.Комментарий = СтрокаКомментария;
				
			Иначе
				
				Стр.Комментарий = "";
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// разделяем таблицы
	// ---------------------------------------------------------------------------- 
	ТаблицаАвансов = ТаблицаОСВ.Скопировать(_сф.ст_Отбор("ЭтоАванс",Истина));
	ТаблицаАвансов.Сортировать("Дата Возр");
	ТаблицаОплат = ТаблицаОСВ.Скопировать(_сф.ст_Отбор("ЭтоАванс",Ложь));
	ТаблицаОплат.Сортировать("Дата Возр");
	
	// ---------------------------------------------------------------------------- 
	
	// выводим таблицу авансов
	Если ТаблицаАвансов.Количество() <> 0 Тогда
		
		Если ЭтоПокупатель Тогда
			
			Множитель = -1;
			КолонкаПриход = "КО";
			КолонкаРасход = "ДО";
			
		Иначе
			
			Множитель = 1;
			КолонкаПриход = "ДО";
			КолонкаРасход = "КО";
			
		КонецЕсли;
		
		// выводим
		ОбластьШТ = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьШТ.Параметры.НазваниеТаблицы = "Расчёты по авансам";
		// --- 
		ОбластьШТ.Параметры.Документ = "Платёжный документ";
		ОбластьШТ.Параметры.НС = "Сальдо на "+Формат(НачалоПериода,ФорматДаты);
		ОбластьШТ.Параметры.ДО = "Оплачено";
		ОбластьШТ.Параметры.КО = "Зачтено";
		ОбластьШТ.Параметры.КС = "Сальдо на "+Формат(НачалоДня(КонецПериода),ФорматДаты);
		ОбластьШТ.Параметры.Комментарий = "Комментарий к зачёту";
		// --- 
		Результат.Вывести(ОбластьШТ);
		
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Для каждого Стр Из ТаблицаАвансов Цикл
			
			Область.Параметры.Документ = Стр.ПредставлениеДокумента;
			Область.Параметры.ДокументСсылка = ?(Стр.ВедущийДокумент <> "",Стр.ВедущийДокумент,Стр.Документ); 
			Область.Параметры.Комментарий = Стр.Комментарий; 
			// --- 
			Область.Параметры.НС = Формат(Множитель*Стр.НС,ФорматД);
			Область.Параметры.ДО = Формат(Стр[КолонкаПриход],ФорматД);
			Область.Параметры.КО = Формат(Стр[КолонкаРасход],ФорматД);
			Область.Параметры.КС = Формат(Множитель*Стр.КС,ФорматД);
			// --- 
			Результат.Вывести(Область);
			
		КонецЦикла; 
		
		// выводим итог по авансам
		Область = Макет.ПолучитьОбласть("ИтогТаблицы");
		// --- 
		Область.Параметры.Документ = "ИТОГО:";
		Область.Параметры.Комментарий = "Х";
		// --- 
		Область.Параметры.НС = Формат(Множитель*ТаблицаАвансов.Итог("НС"),ФорматД);
		Область.Параметры.ДО = Формат(ТаблицаАвансов.Итог(КолонкаПриход),ФорматД);
		Область.Параметры.КО = Формат(ТаблицаАвансов.Итог(КолонкаРасход),ФорматД);
		Область.Параметры.КС = Формат(Множитель*ТаблицаАвансов.Итог("КС"),ФорматД);
		// --- 
		СальдоПоАвансам = Множитель*ТаблицаАвансов.Итог("КС");
		// --- 
		Результат.Вывести(Область);
		
		// --- 
		
		Область = Макет.ПолучитьОбласть("ПустаяСтрока");
		Результат.Вывести(Область);
		
	КонецЕсли; 
	
	// выводим таблицу оплат
	Если ТаблицаОплат.Количество() <> 0 Тогда
		
		Если ЭтоПокупатель Тогда
			
			Множитель = 1;
			КолонкаПриход = "ДО";
			КолонкаРасход = "КО";
			
		Иначе
			
			Множитель = -1;
			КолонкаПриход = "КО";
			КолонкаРасход = "ДО";
			
		КонецЕсли;
		
		// выводим
		ОбластьШТ = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьШТ.Параметры.НазваниеТаблицы = "Расчёты по оказанным услугам";
		// --- 
		ОбластьШТ.Параметры.Документ = "Документ расчётов";
		ОбластьШТ.Параметры.НС = "Сальдо на "+Формат(НачалоПериода,ФорматДаты);
		ОбластьШТ.Параметры.ДО = "Выставлено";
		ОбластьШТ.Параметры.КО = "Оплачено /зачтено";
		ОбластьШТ.Параметры.КС = "Сальдо на "+Формат(НачалоДня(КонецПериода),ФорматДаты);
		ОбластьШТ.Параметры.Комментарий = "Комментарий к зачёту/оплате";
		// --- 
		Результат.Вывести(ОбластьШТ);
		
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Для каждого Стр Из ТаблицаОплат Цикл
			
			Область.Параметры.Документ = Стр.ПредставлениеДокумента;
			Область.Параметры.ДокументСсылка = ?(Стр.ВедущийДокумент <> "",Стр.ВедущийДокумент,Стр.Документ); 
			Область.Параметры.Комментарий = Стр.Комментарий; 
			// --- 
			Область.Параметры.НС = Формат(Множитель*Стр.НС,ФорматД);
			Область.Параметры.ДО = Формат(Стр[КолонкаПриход],ФорматД);
			Область.Параметры.КО = Формат(Стр[КолонкаРасход],ФорматД);
			Область.Параметры.КС = Формат(Множитель*Стр.КС,ФорматД);
			// --- 
			Результат.Вывести(Область);
			
		КонецЦикла; 
		
		// выводим итог по авансам
		Область = Макет.ПолучитьОбласть("ИтогТаблицы");
		// --- 
		Область.Параметры.Документ = "ИТОГО:";
		Область.Параметры.Комментарий = "Х";
		// --- 
		Область.Параметры.НС = Формат(Множитель*ТаблицаОплат.Итог("НС"),ФорматД);
		Область.Параметры.ДО = Формат(ТаблицаОплат.Итог(КолонкаПриход),ФорматД);
		Область.Параметры.КО = Формат(ТаблицаОплат.Итог(КолонкаРасход),ФорматД);
		Область.Параметры.КС = Формат(Множитель*ТаблицаОплат.Итог("КС"),ФорматД);
		// --- 
		СальдоПоЗадолженности = Множитель*ТаблицаОплат.Итог("КС");
		// --- 
		Результат.Вывести(Область);
		
		// --- 
		
		Область = Макет.ПолучитьОбласть("ПустаяСтрока");
		Результат.Вывести(Область);
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	// выводим игого
	
	Задолженность = СальдоПоЗадолженности - СальдоПоАвансам;
	ЗнакЗадолженности = 0;
	
	Если ЭтоПокупатель Тогда
		
		Если Задолженность > 0 Тогда
			
			// в пользу нас
			ЗнакЗадолженности = 1;
			
		ИначеЕсли Задолженность < 0 Тогда 
			
			// в пользу контрагента
			ЗнакЗадолженности = -1;
			
		Иначе
			
			// =0
			
		КонецЕсли; 
		
	Иначе // поставщик
		
		Если Задолженность > 0 Тогда
			
			// в пользу контрагента
			ЗнакЗадолженности = -1;
						
		ИначеЕсли Задолженность < 0 Тогда 
			
			// в пользу нас
			ЗнакЗадолженности = 1;
			
		Иначе
			
			// =0
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Область = Макет.ПолучитьОбласть("ПустаяСтрока");
	Результат.Вывести(Область);
	// --- 
	Область = Макет.ПолучитьОбласть("СтрокаТекста");
	ТекстИтого = "По данным "+Договор.Организация.НаименованиеСокращенное+" на "+Формат(КонецПериода,ФорматДаты)+" задолженность ";
	Если Задолженность=0 Тогда
		
		_сф.стр_Добавить(ТекстИтого,"отсутствует.");
		
	Иначе
		
		_сф.стр_Добавить(ТекстИтого,"в пользу "+?(ЗнакЗадолженности > 0,Договор.Организация.НаименованиеСокращенное,Договор.Владелец.НаименованиеПолное)+" ");
		_сф.стр_Добавить(ТекстИтого,Формат(_сф.Модуль(Задолженность),"ЧЦ=15; ЧДЦ=2")+" "+Договор.ВалютаДоговора.Наименование+" (");
		ТекстПрописи = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(_сф.Модуль(Задолженность),Договор.ВалютаДоговора); // ВызовБП
		_сф.стр_Добавить(ТекстИтого,ТекстПрописи+").");
		
	КонецЕсли; 
	
	Область.Параметры.Текст = ТекстИтого;
	Результат.Вывести(Область);
	// --- 
	
	Область = Макет.ПолучитьОбласть("Подписи");
	// --- 
	Область.Параметры.НадписьРаботуСдал 	= "Исполнитель:";
	Область.Параметры.НадписьРаботуПринял 	= "Заказчик:";
	
	Подписанты = ВернутьПодписантов(Договор.Организация, ЭтотОбъект.КонецПериода, ПД);
	
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		
		Область.Параметры.ДолжностьИсполнителя 	= ПД.ДолжностьРуководителя;
		Область.Параметры.ФиоИсполнителя 		= CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПД.Руководитель);
	
		Область.Параметры.ДолжностьЗаказчика 	= Подписанты.РуководительДолжностьРус;
		Область.Параметры.ФиоЗаказчика 			= CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель);
		
	ИначеЕсли  Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		
		Область.Параметры.ДолжностьИсполнителя 	= Подписанты.РуководительДолжностьРус;
		Область.Параметры.ФиоИсполнителя 		= CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель);
		
		Область.Параметры.ДолжностьЗаказчика 	= ПД.ДолжностьРуководителя;
		Область.Параметры.ФиоЗаказчика 			= CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПД.Руководитель);
		
	КонецЕсли;

	Область.Параметры.НадписьМП = "М.П.";
	
	Результат.Вывести(Область);
	
	Возврат(_УФКС.Ответ());
	
КонецФункции

Процедура СформироватьРеквизитыШапки(ТД,Макет,Договор,ПД)
	// --- 
	
	Контрагент = Договор.Владелец;
	Организация = Договор.Организация;
	// ПД - параметры договора
	
	// язык печати документов : 0=русский 1=английский 2=двуязычный
	Если ПД.ЯзыкПечатиДокументов=1 Тогда 
		
		Область = Макет.ПолучитьОбласть("Шапка_Иностр");
		стр = CW_Настройки.ПараметрУчетнойПолитики(КонецПериода, Организация, "НаименованиеОрганизацииАнгл")+Символы.ПС+ПД.АдресОрганизацииАнгл;
		Область.Параметры.ТекстШапки = стр;
		ТД.Вывести(Область);
		
	ИначеЕсли ПД.ЯзыкПечатиДокументов=2 Тогда 
		
		Область = Макет.ПолучитьОбласть("Шапка_Иностр");
		стр = Организация.НаименованиеСокращенное+Символы.ПС+ПД.АдресОрганизации+", тел.: "+ПД.ТелефонОрганизации
		+ Символы.ПС
		+ CW_Настройки.ПараметрУчетнойПолитики(КонецПериода, Организация, "НаименованиеОрганизацииАнгл")+Символы.ПС+ПД.АдресОрганизацииАнгл;
		Область.Параметры.ТекстШапки = стр;
		ТД.Вывести(Область);
		
	Иначе 
		
		Если (Договор.ВалютаДоговора=CW_Настройки.ВалютаРегламентированногоУчета()) ИЛИ Договор.ВзаиморасчетыВУЕ Тогда 
			
			Область = Макет.ПолучитьОбласть("Шапка_Рус");
			// --- 
			Исполнитель = Организация.НаименованиеСокращенное + Символы.ПС +
			"ИНН: "+ Организация.ИНН + Символы.ПС +
			"Адрес: " + ПД.АдресОрганизации + Символы.ПС +
			"Р/С: " + ПД.РасчетныйСчетОрганизации.НомерСчета + Символы.ПС + ПД.РасчетныйСчетОрганизации.Банк.Наименование + Символы.ПС +
			"К/С: " + ПД.РасчетныйСчетОрганизации.Банк.КоррСчет + Символы.ПС +
			"БИК: " + ПД.РасчетныйСчетОрганизации.Банк.Код;
			
			Заказчик = Контрагент.НаименованиеПолное + Символы.ПС +
			"ИНН: "+ Контрагент.ИНН + Символы.ПС +
			"Адрес: " + ПД.Адрес + Символы.ПС +
			"Р/С: " + ПД.РасчетныйСчет.НомерСчета + Символы.ПС + ПД.РасчетныйСчет.Банк.Наименование + Символы.ПС +
			"К/С: " + ПД.РасчетныйСчет.Банк.КоррСчет + Символы.ПС +
			"БИК: " + ПД.РасчетныйСчет.Банк.Код;
			
			Область.Параметры.НадписьИсполнитель = "Исполнитель:";
			Область.Параметры.НадписьЗаказчик    = "Заказчик:";
			Область.Параметры.Исполнитель = Исполнитель;
			Область.Параметры.Заказчик = Заказчик;  
			
			//AFR-233368
			Если Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
				Область.Параметры.Исполнитель 	= Заказчик;
				Область.Параметры.Заказчик 		= Исполнитель;  
			КонецЕсли;
			//AFR-233368
			
			ТД.Вывести(Область);
			
		Иначе 
			
			Область = Макет.ПолучитьОбласть("Шапка_Иностр");
			стр = Организация.НаименованиеСокращенное+Символы.ПС+ПД.АдресОрганизации+", тел.: "+ПД.ТелефонОрганизации;
			Область.Параметры.ТекстШапки = стр;
			ТД.Вывести(Область);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

Процедура СформироватьШапку(ТД,Макет,Договор,ПД)
	// --- 
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заголовок = "Акт сверки";
	ТД.Вывести(Область);
	// --- 
	Область = Макет.ПолучитьОбласть("СтрокаЗаголовка");
	Область.Параметры.Текст = "взаимных расчётов за период "+ПредставлениеПериода(НачалоДня(НачалоПериода),КонецДня(КонецПериода));
	ТД.Вывести(Область);
	Область.Параметры.Текст = "между "+Договор.Организация.НаименованиеСокращенное+" и "+Договор.Владелец.НаименованиеПолное+
	" по договору №"+?(Договор.НомерДоговора="","<?>",Договор.НомерДоговора)+" от "+Формат(Договор.ДатаДоговора,"ДФ=dd.MM.yyyy");
	ТД.Вывести(Область);
	// --- 
	Область = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТД.Вывести(Область);
	// --- 
	
	Область = Макет.ПолучитьОбласть("СтрокаТекста");
	Область.Параметры.Текст = "Мы, нижеподписавшиеся, "+НРег(ПД.ДолжностьРуководителяОрганизации)+" "+Договор.Организация.НаименованиеСокращенное+" "+CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПД.РуководительОрганизации.Наименование)+", "+
	"с одной стороны, и "+НРег(ПД.ДолжностьРуководителя)+" "+Договор.Владелец.НаименованиеПолное+" "+CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПД.Руководитель)+", с другой стороны, "+
	"составили настоящий акт сверки в том, что состояние взаимных расчётов по данным учёта следующее:";
	ТД.Вывести(Область);
	
	// --- 
КонецПроцедуры

Функция ПредставлениеДокумента(Документ, Тип=Неопределено)
	
	ФорматДаты = "ДФ=dd.MM.yy";
	
	Если Тип = Неопределено Тогда
		
		Тип = ТипЗнч(Документ);
		
	КонецЕсли; 
	
	Если Тип = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		
		Номер = "";
		Если СокрЛП(Документ.НомерВходящегоДокумента) <> "" Тогда
			
			Номер = Документ.НомерВходящегоДокумента;
			
		Иначе
			
			Номер = "(?)";
			
		КонецЕсли; 
		Если Документ.ДатаВходящегоДокумента <> Дата(1,1,1) Тогда
			
			Дата = Документ.ДатаВходящегоДокумента;
			
		Иначе
			
			Дата = Документ.Дата;
			
		КонецЕсли; 
		
		Представление = "п/п "+Номер+" от "+Формат(Дата,ФорматДаты);
		
	ИначеЕсли Тип = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		
		Номер = CW_Документы.ПолучитьНомерНаПечать(Документ);
		Дата = Документ.Дата;
		Представление = "ПКО "+Номер+" от "+Формат(Дата,ФорматДаты); 
		
	ИначеЕсли Тип = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда 
		
		Номер = "";
		Если СокрЛП(Документ.НомерВходящегоДокумента) <> "" Тогда
			
			Номер = Документ.НомерВходящегоДокумента;
			
		Иначе
			
			Номер = "(?)";
			
		КонецЕсли; 
		Если Документ.ДатаВходящегоДокумента <> Дата(1,1,1) Тогда
			
			Дата = Документ.ДатаВходящегоДокумента;
			
		Иначе
			
			Дата = Документ.Дата;
			
		КонецЕсли; 
		
		Представление = "п/п "+Номер+" от "+Формат(Дата,ФорматДаты); 
		
	ИначеЕсли Тип = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		
		Номер = CW_Документы.ПолучитьНомерНаПечать(Документ);
		Дата = Документ.Дата;
		Представление = "РКО "+Номер+" от "+Формат(Дата,ФорматДаты); 
		
	ИначеЕсли Тип = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда 
		
		Если Документ.ДатаАкта <> Дата(1,1,1) Тогда
			
			Дата = Документ.ДатаАкта;
			
		Иначе
			
			Дата = Документ.Дата;
			
		КонецЕсли; 
		
		Представление = Документ.ПредставлениеДокумента;
				
	ИначеЕсли Тип = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда 	
		
		Если Документ.ДатаАкта <> Дата(1,1,1) Тогда
			
			Дата = Документ.ДатаАкта;
			
		Иначе
			
			Если Документ.ДатаСФ <> Дата(1,1,1) Тогда
				
				Дата = Документ.ДатаСФ;
				
			Иначе
				
				Если Документ.ДатаСчета <> Дата(1,1,1) Тогда
					
					Дата = Документ.ДатаСчета;
					
				Иначе
					
					Дата = Документ.Дата;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Представление = Документ.ПредставлениеДокумента;
				
	Иначе
		Попытка
			Номер = Документ.Номер;
			Дата = Документ.Дата;
			Представление = "док. "+Номер+" от "+Формат(Дата,ФорматДаты);
			
		// если получили пустую ссылку
		Исключение
			Представление = "<...>";
		КонецПопытки;
		
	КонецЕсли;
	
	Ответ = _сф.ст_Создать("Дата,Представление");
	Ответ.Дата = Дата;
	Ответ.Представление = Представление;
	
	Возврат(Ответ);
	
КонецФункции

Функция СформироватьПредставлениеДокумента(док, Сумма=0, Валюта=Неопределено)
	
	// --- 
	
КонецФункции

Функция СтруктураПримечания(выбДетали, тз)
	
	масс = тз.НайтиСтроки(
		Новый Структура(
			"НомерТаблицы, ДокументРасчетов, Счет", 
			выбДетали.НомерТаблицы,
			выбДетали.ДокументРасчетов,
			выбДетали.Счет
		)
	);
	
	рез = "";
	сз = Новый СписокЗначений;
	Для каждого строкаТЗ Из масс Цикл
		Если строкаТЗ.Сумма<>0 Тогда 
			Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(строкаТЗ.ДокументКорреспондирующий)) И ЗначениеЗаполнено(строкаТЗ.ДокументКорреспондирующий) Тогда 
				// например, в проводках зачета аванса, третье корр-субконто
				рез = рез + "; " + СформироватьПредставлениеДокумента(строкаТЗ.ДокументКорреспондирующий, строкаТЗ.Сумма, строкаТЗ.Валюта);
				сз.Добавить(строкаТЗ.ДокументКорреспондирующий);
			ИначеЕсли выбДетали.ДокументРасчетов<>строкаТЗ.Регистратор Тогда 
				рез = рез + "; " + СформироватьПредставлениеДокумента(строкаТЗ.Регистратор, строкаТЗ.Сумма, строкаТЗ.Валюта);
				сз.Добавить(строкаТЗ.Регистратор);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	рез = Сред(рез, 3);
	
	Возврат Новый Структура("Примечание, Расшифровка", рез, сз);
	
КонецФункции

Функция ПолучитьСписокКонтрагентов() Экспорт 

	// --- 
	
КонецФункции

Функция ВернутьПодписантов(Знач Организация, Знач Дата, Знач ПараметрыДоговора) Экспорт
	
	Ответ = Новый Структура;
		
	Если ПараметрыДоговора.РежимПодписей = 0  Тогда
		
		ВладелецПараметров = ПараметрыДоговора.Договор;
		Если ТипЗнч(ВладелецПараметров) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
			Организация = ВладелецПараметров.Организация;
		Иначе
			Организация = ВладелецПараметров.Договор.Организация;
		КонецЕсли;
		
		ДанныеОтветственных = РегистрыСведений.CW_ПараметрыДоговоров.ПолучитьОтветственныхЛицИзКарточкиОрганизации(Организация, Дата);
		
		Ответ.Вставить("Руководитель",              ДанныеОтветственных.РуководительОрганизации);
		Ответ.Вставить("РуководительПоДоговору",	ДанныеОтветственных.РуководительОрганизации);
		Ответ.Вставить("РуководительДолжностьРус",	ДанныеОтветственных.ДолжностьРуководителя);
		
		Ответ.Вставить("ГлБух",						ДанныеОтветственных.ГлавныйБухгалтер);
		Ответ.Вставить("ГлБухОснованиеРус",			ДанныеОтветственных.ГлавныйБухгалтер);
		
	ИначеЕсли ПараметрыДоговора.РежимПодписей = 1 Тогда
		
		
		Ответ.Вставить("Руководитель",             ПараметрыДоговора.РуководительОрганизации);
		Ответ.Вставить("РуководительДолжностьРус", ПараметрыДоговора.ДолжностьРуководителяОрганизации);
		Ответ.Вставить("РуководительДолжностьАнг", ПараметрыДоговора.ДолжностьРуководителяОрганизацииАнгл);
		Ответ.Вставить("РуководительОснованиеРус", ПараметрыДоговора.РуководительОснование);
		Ответ.Вставить("РуководительОснованиеАнг", ПараметрыДоговора.РуководительОснованиеАнгл);	
		
		Ответ.Вставить("ГлБух",             ПараметрыДоговора.ГлавныйБухгалтерОрганизации);
		Ответ.Вставить("ГлБухОснованиеРус", ПараметрыДоговора.ГлавныйБухгалтерОснование);
		Ответ.Вставить("ГлБухОснованиеАнг", ПараметрыДоговора.ГлавныйБухгалтерОснованиеАнгл);	
		
	ИначеЕсли ПараметрыДоговора.РежимПодписей = 2 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.Руководитель,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительДолжность,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительДолжностьАнгл,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительОснование,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительОснованиеАнгл,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтер,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтерОснование,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтерОснованиеАнгл
			|ИЗ
			|	РегистрСведений.CW_ЛицаПодписывающиеДокументы.СрезПоследних(
			|			&Дата,
			|			Вариант = &Вариант
			|				И Организация = &Организация) КАК CW_ЛицаПодписывающиеДокументыСрезПоследних";
		Запрос.УстановитьПараметр("Вариант", ПараметрыДоговора.ВариантПодписей);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Дата", Дата);
		ТЗ = Запрос.Выполнить().Выбрать();
		Если ТЗ.Следующий() Тогда
				Ответ.Вставить("Руководитель",             ТЗ.Руководитель);
				Ответ.Вставить("РуководительДолжностьРус", ТЗ.РуководительДолжность);
				Ответ.Вставить("РуководительДолжностьАнг", ТЗ.РуководительДолжностьАнгл);
				Ответ.Вставить("РуководительОснованиеРус", ТЗ.РуководительОснование);
				Ответ.Вставить("РуководительОснованиеАнг", ТЗ.РуководительОснованиеАнгл);
				
				Ответ.Вставить("ГлБух",             ТЗ.ГлБухгалтер);
				Ответ.Вставить("ГлБухОснованиеРус", ТЗ.ГлБухгалтерОснование);
				Ответ.Вставить("ГлБухОснованиеАнг", ТЗ.ГлБухгалтерОснованиеАнгл);
		Иначе
				Ответ.Вставить("Руководитель",             "");
				Ответ.Вставить("РуководительДолжностьРус", "");
				Ответ.Вставить("РуководительДолжностьАнг", "");
				Ответ.Вставить("РуководительОснованиеРус", "");
				Ответ.Вставить("РуководительОснованиеАнг", "");
			
				Ответ.Вставить("ГлБух",             "");
				Ответ.Вставить("ГлБухОснованиеРус", "");
				Ответ.Вставить("ГлБухОснованиеАнг", "");		
		КонецЕсли;	
		
	КонецЕсли;	
	
	Возврат(Ответ);
	
КонецФункции

#КонецЕсли
